In [1]:
import pandas as pd
data = pd.read_csv('age_of_marriage_data.csv')
print(data.shape)
data.head()

(2567, 10)

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
0,1,female,"5'4""",NaN,others,Telugu,NaN,London,United Kingdom,21.0
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0

In [2]:
data.isnull().sum()

id                   0
gender              29
height             118
religion           635
caste              142
mother_tongue      164
profession         330
location           155
country             16
age_of_marriage     19
dtype: int64

In [3]:
(data.shape[0] - data.dropna().shape[0])/data.shape[0]

0.24737047136735488

In [4]:
data.dropna(inplace=True)

In [5]:
data.shape

(1932, 10)

In [6]:
data.profession.unique()

array(['Doctor / Healthcare Professional', 'Entrepreneurs / Business ',
       'Architect', 'Sales Professional / Marketing', 'Sportsman',
       'Banking Professional', 'Software Professional', 'HR Professional',
       'Finance Professional', 'Not Specified', 'Not working',
       'Chartered Accountant', 'Logistics and Travel Professional',
       'Defense Services', 'Team Member / Staff',
       'Managers and Senior Executives', 'Admin Professional',
       'Accounting Professional (Others)', 'Investment Professional',
       'Civil Engineer', 'Consultant / Supervisor / Team Leads',
       'Public Relations Professional', 'Training Professional (Others)',
       'Hotel & Hospitality Professional (Others)',
       'Software Professional (Others)', 'Nurse', 'Artist (Others)',
       'Non IT Engineer (Others)', 'Event Manager',
       'Marketing Professional', 'Science Professional (Others)',
       'Mechanical / Production Engineer', 'Research Assistant',
       'Electronics / Telecom Engineer', 'Teacher', 'Professor',
       'Interior Designer', 'Fashion Designer', 'Beautician',
       'Software Consultant',
       'Medical / Healthcare Professional (Others)',
       'Agent / Broker / Trader / Contractor', 'Lawyer',
       'Hardware & Networking professional', 'Web / UX Designers',
       'Pharmacist', 'Research Scholar', 'Actor',
       'Entertainment Professional', 'Student',
       'Customer Support / BPO / KPO Professional', 'Designer (Others)',
       'Media Professional', 'Physiotherapist / Occupational Therapist',
       'Merchant Naval Officer', 'VP / AVP / GM / DGM',
       'CxO / Chairman / Director / President', 'IAS / IRS / IES / IFS',
       'Writer', 'Lecturer', 'Other Airline Professional',
       'Social Worker / Volunteer / NGO', 'Jewellery Designer',
       'Company Secretary', 'Mariner', 'Chef / Sommelier / Food Critic',
       'Law Enforcement Employee (Others)', 'Hairstylist',
       'Agricultural Professional (Others)', 'Farming',
       'Landscape Architect', 'Psychologist', 'Legal Assistant',
       'Dentist', 'Surgeon', 'Legal Professional (Others)',
       'Air Hostess / Flight Attendant', 'Advertising Professional',
       'Indian Police Services [IPS]', 'Medical Transcriptionist',
       'Physician Assistant', 'Commercial Artist',
       'Veterinary Doctor / Healthcare Professional', 'Pilot / Co-Pilot'],
      dtype=object)

In [7]:
data.caste.unique()

array([' Shwetamber', ' Brahmin', ' Thakur', ' Born Again', ' Valmiki',
       ' Rajput - Lodhi', ' Bhatia', ' Billava', ' Vanniyar', ' Agri',
       ' Marthoma', ' Ahom', ' Baishnab', ' Roman Catholic', ' Lingayath',
       ' Kalita', ' Vaishnav', ' Sahu', ' Baishya', ' Memon', ' Agarwal',
       ' Panchal', ' Baidya', ' Kaibarta', ' Sindhi-Sakkhar',
       ' Viswabrahmin', ' Patel', ' Scheduled Caste (SC)', ' Kshatriya',
       ' Ramdasia', ' Khatri', ' OBC - Barber/Naayee', ' Baniya', ' Goud',
       ' Balija', ' Arora', ' Kayastha', ' Gursikh', ' Arya Vysya',
       ' Bhandari', ' Saini'], dtype=object)

In [8]:
X = data.drop(['profession','age_of_marriage','id','location'], axis =1)
y = data.age_of_marriage

In [10]:
y

1       32.0
2       32.0
3       30.0
4       30.0
5       29.0
        ...
2561    30.0
2562    27.0
2563    31.0
2564    28.0
2566    32.0
Name: age_of_marriage, Length: 1932, dtype: float64

In [11]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [12]:
X.apply(encoder.fit_transform)

      gender  height  religion  caste  mother_tongue  country
1          1      16         2     34              6       19
2          1      16         1     14              8        5
3          0       7         1     36              8        5
4          1      14         0     13             13        5
5          1      14         1     38              8        5
...      ...     ...       ...    ...            ...      ...
2561       1      10         1     21             18        5
2562       0      12         1     36              8        5
2563       1      10         1     36              8        3
2564       0      12         1      7              2        5
2566       0      11         0     23             13        5

[1932 rows x 6 columns]

In [13]:
int(X.loc[1,'height'].split('\'')[0])*12*2.54

152.4

In [14]:
int(X.loc[1,'height'].split('\'')[1].replace('"',''))*2.54

17.78

In [15]:
def inch_to_cm(x):
    a=int(x.split('\'')[0])*12*2.54
    b=int(x.split('\'')[1].replace('"',''))*2.54
    return a+b

In [16]:
X['height'] = X['height'].apply(inch_to_cm)

In [17]:
X.head(10)

    gender  height   religion            caste mother_tongue country
1     male  170.18       Jain       Shwetamber      Gujarati     USA
2     male  170.18      Hindu          Brahmin         Hindi   India
3   female  152.40      Hindu           Thakur         Hindi   India
4     male  165.10  Christian       Born Again     Malayalam   India
5     male  165.10      Hindu          Valmiki         Hindi   India
6   female  157.48      Hindu   Rajput - Lodhi         Hindi   India
7     male  165.10      Hindu           Bhatia       Punjabi   India
8   female  165.10       Jain       Shwetamber      Gujarati   India
9   female  154.94      Hindu          Billava          Tulu   India
11    male  175.26      Hindu          Brahmin       Bengali   India

In [21]:
columns = ['gender','religion','caste','mother_tongue','country']
mapping_dict ={}

for col in columns:
    X[col] = encoder.fit_transform(X[col])
 
    le_name_mapping = dict(zip(encoder.classes_,
                        encoder.transform(encoder.classes_)))
 
    mapping_dict[col]= le_name_mapping
print(mapping_dict)

{'gender': {'female': 0, 'male': 1}, 'religion': {'Christian': 0, 'Hindu': 1, 'Jain': 2, 'Muslim': 3, 'Sikh': 4}, 'caste': {' Agarwal': 0, ' Agri': 1, ' Ahom': 2, ' Arora': 3, ' Arya Vysya': 4, ' Baidya': 5, ' Baishnab': 6, ' Baishya': 7, ' Balija': 8, ' Baniya': 9, ' Bhandari': 10, ' Bhatia': 11, ' Billava': 12, ' Born Again': 13, ' Brahmin': 14, ' Goud': 15, ' Gursikh': 16, ' Kaibarta': 17, ' Kalita': 18, ' Kayastha': 19, ' Khatri': 20, ' Kshatriya': 21, ' Lingayath': 22, ' Marthoma': 23, ' Memon': 24, ' OBC - Barber/Naayee': 25, ' Panchal': 26, ' Patel': 27, ' Rajput - Lodhi': 28, ' Ramdasia': 29, ' Roman Catholic': 30, ' Sahu': 31, ' Saini': 32, ' Scheduled Caste (SC)': 33, ' Shwetamber': 34, ' Sindhi-Sakkhar': 35, ' Thakur': 36, ' Vaishnav': 37, ' Valmiki': 38, ' Vanniyar': 39, ' Viswabrahmin': 40}, 'mother_tongue': {'Aka': 0, 'Assamese': 1, 'Bengali': 2, 'Bhojpuri': 3, 'Chattisgarhi': 4, 'English': 5, 'Gujarati': 6, 'Haryanavi': 7, 'Hindi': 8, 'Kannada': 9, 'Kashmiri': 10, 'Konkani': 11, 'Kutchi': 12, 'Malayalam': 13, 'Manipuri': 14, 'Marathi': 15, 'Marwari': 16, 'Nepali': 17, 'Odia': 18, 'Other': 19, 'Punjabi': 20, 'Rajasthani': 21, 'Sindhi': 22, 'Tamil': 23, 'Telugu': 24, 'Tulu': 25, 'Urdu': 26}, 'country': {' Australia': 0, ' Bahrain': 1, ' Bangladesh': 2, ' Canada': 3, ' Germany': 4, ' India': 5, ' Ireland': 6, ' Kuwait': 7, ' Malaysia': 8, ' Myanmar': 9, ' Netherlands': 10, ' New Zealand': 11, ' Norway': 12, ' Oman': 13, ' Pakistan': 14, ' Philippines': 15, ' Qatar': 16, ' Singapore': 17, ' South Africa': 18, ' USA': 19, ' United Arab Emirates': 20, ' United Kingdom': 21}}

In [57]:
#X.loc[:,['gender','religion','caste','mother_tongue','country']] = \
#X.loc[:,['gender','religion','caste','mother_tongue','country']].apply(encoder.fit_transform)

In [22]:
X.head()

   gender  height  religion  caste  mother_tongue  country
1       1  170.18         2     34              6       19
2       1  170.18         1     14              8        5
3       0  152.40         1     36              8        5
4       1  165.10         0     13             13        5
5       1  165.10         1     38              8        5

In [23]:

from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=0)

In [24]:
from sklearn.ensemble import RandomForestRegressor
model = RandomForestRegressor(n_estimators=80,max_depth=11)
model.fit(X_train,y_train)
y_predict = model.predict(X_test)

## Evaluation

In [25]:
from sklearn.metrics import mean_absolute_error, r2_score
print("MAE : ", mean_absolute_error(y_test,y_predict))
r2_score(y_test,y_predict)

MAE :  1.0424182081420916

0.697861714346409

In [28]:
model.predict([[1,180,1,0,6,5]])

array([31.42854642])


# Export model

In [29]:
from joblib import dump, load
dump(model,'marriage_age_predict_model.ml')

['marriage_age_predict_model.ml']